spec/vcr/Api_V1_My_OrdersController/pay/Can_t_find_paypal_payment_.yml

---
http_interactions:
- request:
    method: post
    uri: https://ATqzAhBOpH7HX6JSJfd0iiLwxV-NY6Q_dkgPJ3vWiZjduwozYhZW6QKTGPdV:ECLwyBDuAXKH2uAy5thfqnJa2SsTtc5S208TWcvLbuK3xfD5r_O3OX8HY4PS@api.sandbox.paypal.com/v1/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      content-type:
      - application/x-www-form-urlencoded
      authorization:
      - Basic QVRxekFoQk9wSDdIWDZKU0pmZDBpaUx3eFYtTlk2UV9ka2dQSjN2V2laamR1d296WWhaVzZRS1RHUGRWOkVDTHd5QkR1QVhLSDJ1QXk1dGhmcW5KYTJTc1R0YzVTMjA4VFdjdkxidUszeGZENXJfTzNPWDhIWTRQUw==
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3002.slc.paypal.com;threadId=1306
      paypal-debug-id:
      - cd285c7ecc5bd
      server_info:
      - identitysecuretokenserv:v1.oauth2.token&CalThreadId=31220&TopLevelTxnStartTime=14a566b89e3&Host=slcsbidensectoken501.slc.paypal.com&pid=3787
      date:
      - Wed, 17 Dec 2014 04:04:56 GMT
      content-type:
      - application/json
      content-length:
      - '428'
    body:
      encoding: UTF-8
      string: '{"scope":"https://uri.paypal.com/services/subscriptions https://api.paypal.com/v1/payments/.*
        https://api.paypal.com/v1/vault/credit-card https://uri.paypal.com/services/applications/webhooks
        openid https://uri.paypal.com/services/invoicing https://api.paypal.com/v1/vault/credit-card/.*","access_token":"A015guBaCdN.-o9snR7Fsexe4qsc-WQhDL6cNdTNhRjVGJ0","token_type":"Bearer","app_id":"APP-80W284485P519543T","expires_in":28800}'
    http_version: '1.1'
  recorded_at: Wed, 17 Dec 2014 04:04:56 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment
    body:
      encoding: UTF-8
      string: '{"intent":"sale","payer":{"payment_method":"credit_card","funding_instruments":[{"credit_card":{"number":"4417119669820331","type":"visa","expire_month":11,"expire_year":2018,"cvv2":"874","first_name":"Joe","last_name":"Shopper","billing_address":{"line1":"52
        N Main ST","city":"Johnstown","country_code":"US","postal_code":"43210","state":"OH"}}}]},"transactions":[{"amount":{"currency":"USD","total":"1.00"},"description":"This
        is the payment transaction description.","item_list":{"items":[{"quantity":"1","name":"item","price":"1","currency":"USD","sku":"item"}]}}]}'
    headers:
      x-paypal-sandbox-email-address:
      - Platform.sdk.seller@gmail.com
      authorization:
      - Bearer A015guBaCdN.-o9snR7Fsexe4qsc-WQhDL6cNdTNhRjVGJ0
      content-type:
      - application/json
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      paypal-request-id:
      - 11c8c128-dcd3-47bb-8b5b-7837686ef47c
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=2694
      paypal-debug-id:
      - bed151e9cbc1a
      server_info:
      - paymentsplatformserv:v1.payments.payment&CalThreadId=1243&TopLevelTxnStartTime=14a566b9033&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=22545
      content-language:
      - "*"
      date:
      - Wed, 17 Dec 2014 04:05:20 GMT
      content-type:
      - application/json
      content-length:
      - '1454'
    body:
      encoding: UTF-8
      string: '{"id":"PAY-5J720401KU2930507KSIQB2I","create_time":"2014-12-17T04:04:57Z","update_time":"2014-12-17T04:05:20Z","state":"approved","intent":"sale","payer":{"payment_method":"credit_card","funding_instruments":[{"credit_card":{"type":"visa","number":"xxxxxxxxxxxx0331","expire_month":"11","expire_year":"2018","first_name":"Joe","last_name":"Shopper","billing_address":{"line1":"52
        N Main ST","city":"Johnstown","state":"OH","postal_code":"43210","country_code":"US"}}}]},"transactions":[{"amount":{"total":"1.00","currency":"USD","details":{"subtotal":"1.00"}},"description":"This
        is the payment transaction description.","item_list":{"items":[{"name":"item","sku":"item","price":"1.00","currency":"USD","quantity":"1"}]},"related_resources":[{"sale":{"id":"0WM281458E946941D","create_time":"2014-12-17T04:04:57Z","update_time":"2014-12-17T04:05:20Z","amount":{"total":"1.00","currency":"USD"},"state":"completed","parent_payment":"PAY-5J720401KU2930507KSIQB2I","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/sale/0WM281458E946941D","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/sale/0WM281458E946941D/refund","rel":"refund","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-5J720401KU2930507KSIQB2I","rel":"parent_payment","method":"GET"}]}}]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-5J720401KU2930507KSIQB2I","rel":"self","method":"GET"}]}'
    http_version: '1.1'
  recorded_at: Wed, 17 Dec 2014 04:05:21 GMT
- request:
    method: post
    uri: https://collector.newrelic.com/agent_listener/12//get_redirect_host?marshal_format=json
    body:
      encoding: UTF-8
      string: "[]"
    headers:
      content-encoding:
      - identity
      host:
      - collector.newrelic.com
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
      user-agent:
      - NewRelic-RubyAgent/3.9.0.229 (ruby 2.1.2 x86_64-darwin13.0) zlib/1.2.8
      content-type:
      - application/octet-stream
  response:
    status:
      code: 200
      message: OK
    headers:
      content-type:
      - text/plain
      content-length:
      - '96'
      connection:
      - close
    body:
      encoding: UTF-8
      string: '{"exception":{"message":"Unknown license key","error_type":"NewRelic::Agent::LicenseException"}}'
    http_version: '1.1'
  recorded_at: Wed, 17 Dec 2014 04:05:22 GMT
- request:
    method: get
    uri: https://api.sandbox.paypal.com/v1/payments/payment/blah
    body:
      encoding: US-ASCII
      string: ''
    headers:
      x-paypal-sandbox-email-address:
      - Platform.sdk.seller@gmail.com
      authorization:
      - Bearer A015guBaCdN.-o9snR7Fsexe4qsc-WQhDL6cNdTNhRjVGJ0
      content-type:
      - application/json
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 404
      message: Not Found
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=1275
      paypal-debug-id:
      - 7327911ecc681
      server_info:
      - paymentsplatformserv:v1.payments.payment&CalThreadId=1243&TopLevelTxnStartTime=14a566bf2f2&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=22545
      content-language:
      - "*"
      date:
      - Wed, 17 Dec 2014 04:05:22 GMT
      content-type:
      - application/json
      content-length:
      - '207'
    body:
      encoding: UTF-8
      string: '{"name":"INVALID_RESOURCE_ID","message":"The requested resource ID
        was not found","information_link":"https://developer.paypal.com/webapps/developer/docs/api/#INVALID_RESOURCE_ID","debug_id":"7327911ecc681"}'
    http_version: '1.1'
  recorded_at: Wed, 17 Dec 2014 04:05:22 GMT
recorded_with: VCR 2.9.2
